In [3]:
import mysql.connector as connection
import pandas as pd
try:
    mydb = connection.connect(host="localhost", database = 'myworld',user="myworld", passwd="myworld123",use_pure=True)
    query = "select * from student;"
    result_dataFrame = pd.read_sql(query,mydb)
    mydb.close() #close the connection
except Exception as e:
    mydb.close()
    print(str(e))

/var/folders/fv/ndyjvnp92xg7d8gb0skm091m0000gn/T/ipykernel_33458/1323471252.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_dataFrame = pd.read_sql(query,mydb)

In [5]:
result_dataFrame

   id      name
0   1    Balaji
1   2  Krithika
2   3   Havisha
3   4    Haasya

In [75]:
import pandas as pd
from sqlalchemy import create_engine
connect_string = 'mysql+pymysql://myworld:myworld123@localhost/myworld'
sql_engine = create_engine(connect_string)
query = "select * from student"
df = pd.read_sql_query(query, sql_engine)
df

   id      name
0   1    Balaji
1   2  Krithika
2   3   Havisha
3   4    Haasya